# Basic SQL Queries: TMDb Database
© Explore Data Science Academy

## Instructions to Students

This challenge is designed to determine how much you have learned so far and will test your knowledge on Basic SQL queries.

The answers for this challenge should be selected on Athena for each corresponding Multiple Choice Question. The questions are included in this notebook and are numbered according to the Athena Questions. The options to choose from for each question has also been included.

*NOTE:*
Do not add or remove cells in this notebook. Do not edit or remove the `%%sql` comment as it is required to run each cell.

**_Good Luck!_**

## Honour Code

I HUMPHERY, OJO, confirm - by submitting this document - that the solutions in this notebook are a result of my own work and that I abide by the EDSA honour code (https://drive.google.com/file/d/1QDCjGZJ8-FmJE3bZdIQNwnJyQKPhHZBn/view?usp=sharing).

Non-compliance with the honour code constitutes a material breach of contract.

## The TMDb Database

In this challenge you will be exploring the [The Movie Database](https://www.themoviedb.org/): an online movie and TV show database, which houses some of the most popular movies and TV shows at your finger tips. The TMDb database supports 39 official languages used in over 180 countries daily and dates all the way back to 2008. 


<img src="https://github.com/Explore-AI/Pictures/blob/master/sql_tmdb.jpg?raw=true" width=80%/>


Below is an Entity Relationship Diagram (ERD) of the TMDb database:

<img src="https://github.com/Explore-AI/Pictures/blob/master/TMDB_ER_diagram.png?raw=true" width=70%/>

As can be seen from the ER diagram, the TMDb database consists of `12 tables` containing information about movies, cast, genre and so much more.  

For this challenge we will only be making use of the Movies table from the TMDb database. We will be applying the use of basic SQL queries to gain insightful information from the Movies table. The Movie table consists of: 
- 15 columns
- 4804 rows
- Includes information on movie revenue, release date, popularity and so much more ! 

Let's get started!

## Loading the database

To begin and start making use of SQL queries you need to prepare your SQL environment you can do this by loading in the magic command `%load_ext sql`, next you can go ahead and load in your database. To do this you will need to ensure you have downloaded the `TMDB.db`sqlite file from Athena and have stored it in a known location. Now that you have all the prerequistes you can go ahead and load it into the notebook.

In [2]:
%load_ext sql

In [3]:
%%sql 

sqlite:///TMDB.db

'Connected: @TMDB.db'

## Questions on Basic SQL Queries 

Use the given cell below each question to execute your SQL queries to find the correct input from the options provided for the multiple choice questions on Athena.

To attempt this you will use what you have learned about the following functions and statements:

- SELECT
- FROM
- WHERE
- LIKE
- COUNT
- OR
- AND
- BETWEEN

**Question 1**

What is the SQL code to see the whole movies table?

**Options:** 
- SELECT ALL FROM Movies
- SELECT TABLE FROM Movies
- SELECT * FROM Movies
- SELECT % FROM Movies

In [7]:
%%sql 
SELECT*FROM movies;

 * sqlite:///TMDB.db
(sqlite3.OperationalError) no such table: movies
[SQL: SELECT*FROM movies;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

**Question 2**

What was the budget for the movie “Inception”?

**Options:**
- $224 000 000

- $160 000 000

- $344 000 000

- $115 000 000

In [8]:
%%sql 
SELECT budget FROM movies WHERE title = 'Inception'

 * sqlite:///TMDB.db
(sqlite3.OperationalError) no such table: movies
[SQL: SELECT budget FROM movies WHERE title = 'Inception']
(Background on this error at: https://sqlalche.me/e/14/e3q8)

**Question 3**

What is the runtime of the movie "Titanic"?

**Options:**
- 146
- 158
- 122
- 194

In [9]:
%%sql 
SELECT runtime FROM movies 
WHERE title = "Titanic";

 * sqlite:///TMDB.db
(sqlite3.OperationalError) no such table: movies
[SQL: SELECT runtime FROM movies
WHERE title = "Titanic";]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

**Question 4**

How many movies do not have English as their original language? (Hint: “en” is the abbreviation for English)

**Options:**
- 492
- 298
- 387
- 315

In [10]:
%%sql
SELECT COUNT(*)FROM movies 
WHERE original_language != "en";

 * sqlite:///TMDB.db
(sqlite3.OperationalError) no such table: movies
[SQL: SELECT COUNT(*)FROM movies
WHERE original_language != "en";]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

**Question 5**

How many movies are there that have a popularity score of more than 250?

**Options:**
- 7
- 5
- 9
- 11

In [11]:
%%sql
SELECT COUNT(*)FROM movies 
WHERE popularity > 250;

 * sqlite:///TMDB.db
(sqlite3.OperationalError) no such table: movies
[SQL: SELECT COUNT(*)FROM movies
WHERE popularity > 250;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

**Question 6**

 How many movies are there where the title is not the same as the original title?
 
 **Options:**
 -  187
 - 261
 - 74
 - 24

In [13]:
%%sql
SELECT COUNT(*)FROM movies 
WHERE title != original_title;

 * sqlite:///TMDB.db
(sqlite3.OperationalError) no such table: movies
[SQL: SELECT COUNT(*)FROM movies
WHERE title != original_title;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

**Question 7**

 How many movies are there that managed to get a popularity rating of more than 100 with a budget of less than $10 000 000?
 
**Options:**
 - 11
 - 18
 - 5
 - 15

In [12]:
%%sql
SELECT COUNT(*)FROM movies 
WHERE popularity > 100 AND budget < 10000000;

 * sqlite:///TMDB.db
(sqlite3.OperationalError) no such table: movies
[SQL: SELECT COUNT(*)FROM movies
WHERE popularity > 100 AND budget < 10000000;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

**Question 8** 

How many movies are there that have the word ‘love’ anywhere in the title? (Hint: The L in the word love can be upper or lower case and can be included in words such as ‘lovers’.)

**Options:**
- 67
- 58
- 71
- 49

In [14]:
%%sql
SELECT COUNT(*)FROM movies 
WHERE title LIKE "%Love%";

 * sqlite:///TMDB.db
(sqlite3.OperationalError) no such table: movies
[SQL: SELECT COUNT(*)FROM movies
WHERE title LIKE "%Love%";]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

**Question 9**

How many movies were released between the dates 1 August 2012 and 31 July 2013?  

**Options:**
- 227 
- 295
- 3
- 208

In [16]:
%%sql
SELECT COUNT(*)FROM movies 
WHERE release_date BETWEEN '2012-08-01' AND '2013-07-31';

 * sqlite:///TMDB.db
(sqlite3.OperationalError) no such table: movies
[SQL: SELECT COUNT(*)FROM movies
WHERE release_date BETWEEN '2012-08-01' AND '2013-07-31';]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

**Question 10**

You have had a long day and want to sit back and enjoy a movie.  Unfortunately, today you are only in the mood for a very specific type of movie. It definitely needs to be in English. It should also be new, something after 1 Jan 2010, but not too new as you might have seen it recently, so it must have been released before 1 Jan 2016. It should also be a romantic movie, so make sure it has the word love somewhere in the title.  You also want it to be a big blockbuster, so the budget of the move must be more than $10 000 000.

What is the movie with the highest popularity that meets all of your requirements?

**Options:**
-  Love & Other Drugs
- From Paris with Love
-  Crazy, Stupid, Love
- Eat Pray Love

In [15]:
%%sql
SELECT title FROM movies, genres
WHERE release_date 
    BETWEEN '2010-01-01' AND '2016-01-01' 
    OR original_language = 'en'
    OR genre_name = 'Romance'
    OR budget > 10000000
    
    
    LIMIT 2;

 * sqlite:///TMDB.db
(sqlite3.OperationalError) no such table: movies
[SQL: SELECT title FROM movies, genres
WHERE release_date
    BETWEEN '2010-01-01' AND '2016-01-01'
    OR original_language = 'en'
    OR genre_name = 'Romance'
    OR budget > 10000000


    LIMIT 2;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)